src/DataProcessors/НазначениеВидовМатериалов/НазначениеВидовМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НазначениеВидовМатериалов</name>
</mdclass:DataProcessor>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/НазначениеВидовМатериалов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ВидМатериала") Тогда
	ВидМатериала = ЭтаФорма.Параметры.ВидМатериала;
	КонецЕсли;
		Если ЭтаФорма.Параметры.Свойство("ГруппаМатериалов") Тогда
		ГруппаМатериалов = ЭтаФорма.Параметры.ГруппаМатериалов;
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ГруппаМатериаловПриИзмененииНаСервере()
ТаблицаМатериалов.Очистить();
Выборка = Справочники.Материалы.Выбрать(ГруппаМатериалов,,,"Наименование");
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда		
		ТЧ = ТаблицаМатериалов.Добавить();
		ТЧ.Материал = Выборка.Ссылка;
		ТЧ.ВидМатериала = Выборка.ВидМатериала;
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ГруппаМатериаловПриИзменении(Элемент)
ГруппаМатериаловПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьПоПризнакуНаСервере(Признак)
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
		Если Найти(ТЧ.Материал.Наименование,Признак) > 0 Тогда
		ТЧ.Пометка = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоПризнаку(Команда)
Признак = "";
	Если ВвестиСтроку(Признак,"Введите признак",100) Тогда
	ВыбратьПоПризнакуНаСервере(Признак);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура НазначитьВидМатериалаНаСервере()
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
		Если ТЧ.Пометка Тогда
		Мат = ТЧ.Материал.ПолучитьОбъект();
		Мат.ВидМатериала = ВидМатериала;
		Мат.Записать();
		ТЧ.ВидМатериала = ВидМатериала;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВидМатериала(Команда)
НазначитьВидМатериалаНаСервере();
КонецПроцедуры
